; -----------------------------------
; 無変換キーをベースとしたショートカットキー割当
; -----------------------------------

; 無変換の単発押しは無変換
; vk1D::vk1D

; -----------------------------------
; vimのcursolkey
; -----------------------------------
vk1D & h::Left
vk1D & j::Down
vk1D & k::Up
vk1D & l::Right

; -----------------------------------
; wort jump
; -----------------------------------
vk1D & u::
    if GetKeyState("Shift") {
        Send ^+{Left}
        return
    }
    Send ^{Left}
    return

vk1D & i::
    if GetKeyState("Shift") {
        Send ^{Right}
        return
    }
    Send ^{Right}
    return

; -----------------------------------
; コロン(vkBA)とセミコロン(vkBB)とスペースをEnter
; -----------------------------------
vk1D & vkBa::Enter 
vk1D & vkBB::Enter
vk1D & Space::Enter

; -----------------------------------
; Home / End / BS / Del
; -----------------------------------
vk1D & a::Home
vk1D & e::End
vk1D & n::BS
vk1D & m::Del

; -----------------------------------
; カーソル位置から行末まで削除
; -----------------------------------
vk1D & o::
    send {ShiftDown}{End}{ShiftUp}
    send ^c
    send {Del}
    return

; -----------------------------------
; 変換キーをベースとしたショートカットキー割当
; -----------------------------------

; 変換の単発押しは変換
; vk1C::vk1C

; -----------------------------------
; 変換キー + Home, End, PageUp, PageDown
; -----------------------------------
vk1C & h::Home
vk1C & j::PgDn
vk1C & k::PgUp
vk1C & l::End

; -----------------------------------
; altキーをベースとしたショートカットキー割当 
; -----------------------------------

; -----------------------------------
; Alt + カーソル
; -----------------------------------
LAlt & u::!Left
LAlt & i::!Right

; -----------------------------------
; Ctrl + Space を全角/半角切り替えに割り当てる
; Alt + ` キーに割り当て
; -----------------------------------
^Space::Send, {vkF3sc029}
